= 表紙を作る

表紙は同人誌の顔です。キチンと作ってあげたいところですが、悩ましい部分でもあります。本章と次章はそんな同人誌の表紙の作り方について解説します。（Text：親方）
)

== 表紙デザインについて

技術系同人誌の表紙をどんなデザインにするかは、非常に悩ましい問題です。一般的な同人誌であれば、イラストやマンガを自分で描いているので中身に関連する絵をテーマに合わせて描けばよく、ある意味かんたんです（作成がかんたんと言っているわけではありませんので誤解なきよう）。また、そもそも絵描きの能力があるので、自分で作ればよい/作る必要があるので、悩むところではありません。

一方で、技術書においては、中身は基本的に文字またはコードですから、関連するキャラクターがいるわけでもなければ、内容を表すイラストがあるわけでもありません。しかし、表紙は「同人誌の顔」ですから、見た目は重要です。実際、技術書典などの即売会では、技術書なのに萌え絵のイラストが表紙の本もたくさんあり、眺めているだけで楽しかったりもします。そこで本節では、「同人誌の表紙をどうするか」という問題について扱います。

=== よくある技術系同人誌の表紙

非常に一般的な話として、技術系同人誌の表紙は、大きく以下の3つに分けられると思っています。

　　・有名出版社のオマージュ系表紙

　　・萌イラスト系

　　・写真系

技術書典やコミケで同人誌を買ったことのある方なら納得頂けるのではないでしょうか。

出版社オマージュ系は、例えばオライリー風ならば動物や昆虫などの線画と単色ベタでタイトルを入れたものなので、比較的カンタンに作成できますし、それだけで非常に技術書っぽい表紙になります。デザインとしてもシンプルながら、タイトルもわかりやすく、読者に伝わりやすいでしょう。

写真系は、フリーの写真を使ってもよく、全体デザインの自由度も高いものになります。また、フォントをどうするのか、文字の色や配置をどうするのか、自由であることは、全部自分で考えなければならないということで、なかなか大変です。

イラスト系は、同人誌ならではの表紙で、同人誌を作った！という感じがあふれるものになります。イベント会場でもやはりよく見かけるものですから、一度は作ってみたいものですね。ただし中身と表紙の関係性を結びつけるのはかなり難しく、「表紙と中身は関係ありません」となってしまったりします。

とはいえ、同人誌ですから別に関係なくてもいいのです。ただし、クオリティの高いイラストが表紙だから、技術書として売れるというわけでもないのは悩ましいところです。コミケの技術系島にせよ、技術書典にせよ、「技術書」を買いに来ている人が多数なので、イラストだけでは売れません。よっぽど著名なプロが描いてくれたイラストであれば、その絵だけ買いに来る人もいるかもしれませんが……。

=== フリー素材を利用する場合

オマージュ系と写真系に共通するのは、フリー素材を使って表紙を作るということです。

インターネットにはいくつか同人誌の表紙に使っても大丈夫なライセンスで配布されている画像（イラストもしくは写真）があります。例えば「いらすとや」という有名なフリー素材サイトで配布されているイラストを使ったりします。作風によってはこういったイラストを使うという手があります。

「フリー 画像」とかで検索して素材を探すのもありですが、もう少しいいキーワードがあります。それは@<tt>{CC0}です。これはクリエイティブコモンズ@<fn>{CC}という団体が作ったライセンスの1つで、実質パブリックドメインに該当するものです。つまり商用・非商用問わず、自由に使っていいというライセンスなのです。CC0でライセンスされた写真は山ほどあるので、そういったものを使うというのはよいでしょう。

//footnote[CC][@<href>{https://creativecommons.org/}]

====[column] クリエイティブコモンズ

エンジニアの方ならBSD、GPL、MITライセンスなどをご存じかもしれません。みんなが有名なライセンスを使えば、いちいち細かい規定をしたオリジナルのライセンスにまつわるトラブルから解放されるため、作者・ユーザーに大きな利点となっています。

クリエイティブコモンズも同様の考え方で成り立っています。音楽・写真・文芸など、芸術・創作系での採用例が多いものです。クリエイティブコモンズは基本的には○○は許可する。○○は許可しない、などを選んで組み合わせるスタイルです。その中でも一番シンプルなのがCC0です。

パブリックドメイン、つまり著作権の行使を放棄するというのは、じつは多くの国では法的に面倒ごとが生じやすいのですが、そういう面倒が生じない程度に規定されたライセンスがCC0です。

みなさんもプログラム以外の何かを公開するときにCC0やクリエイティブコモンズを検討してみてもいいかもしれません。（Text:erukiti／佐々木俊介） 

====[/column]

== イラスト系表紙をクラウドソーシングで作る

イラスト系表紙の魅力は大きいとはいえ、その調達方法についてはかなりのハードルがあることも事実です。要するに、そのイラストをどうやって入手するか、という問題です。自分で描けるならそもそもそんなことで悩む必要はなく、一般的に誰かにお願いする必要があるわけですが、そのツテをさがすことも大変です。そこで有効なのが、クラウドソーシングです。

=== クラウドソーシングとは？

クラウドソーシング（英語: crowdsourcing）とは、不特定多数の人に募集をかけ、必要とするサービス、アイデア、またはコンテンツなどの成果を取得するプロセスです。ある種デジタル内職ともいえる形態で、仕事を依頼したいクライアントと、仕事を受けたいワーカー/ランサーとのマッチングを行うサイトはいくつかの企業が展開しています。一般には、マッチングサイトを提供するとともに、対価の幾ばくか(20%程度)を手数料として徴収しているビジネスモデルとなっているようです。

詳細な依頼方法などは、直接当該サイトを見ていただくとして、ここを読んでいる人は、同人誌表紙を誰かに作ってほしい側ですから、クライアントになるわけです。発注仕様や報酬を決めて依頼を出すと、数日から数週間のうちに成果が得られる、とっても便利なサービスで、筆者自身最近の同人誌表紙イラストはクラウドソーシングに依頼しております。

そこで、本節では、クラウドソーシングに依頼するメリットおよび依頼に当たっての実際についてまとめたいと思います。

=== クラウドソーシングに依頼するメリット

なんといっても、比較的安価な原稿料で、クオリティの高い表紙イラストが手に入ることです。先に述べたように、特注イラストを誰にお願いするか、という問題は非常に悩ましい問題で、そもそもお願いできる先に心当たりがない場合が多いかと思います。友人知人にイラストが趣味な人がいればよいのですが、その人とて本業が忙しいなどの都合があり、お願いしづらいかと思います。また、TwitterやPixivで「イラストお仕事募集」とやっている絵師さんなどもいらっしゃいますが、直接依頼するのもなかなかハードルが高いものです。

それに対し、クラウドソーシングは、絵師サイドで発注者を待つシステムですから、やる気のある人しかエントリーしません。依頼を出したのにスルーされた、などといった無駄に精神を削られることは発生しません。

また、発注仕様を自分で決められるので、キャラ指定、タイトル入れの依頼も可能です。デザイン含めてまとめて依頼することも可能ですから、自分のデザインセンスのなさに絶望する必要はありません。

また外注費も魅力の一つです。筆者のこれまでの体験から、15000円程度の費用で表紙イラストの完全データを上げてもらえます。絵師側からすると、全体に安すぎるという意見・指摘もあろうと思いますし、その指摘も理解はするところです。とはいえ、同人誌発行における収支を計算すると、イラスト部分の費用にも自ずと限界が生じます。そういう意味で、これくらいの費用であれば十分安価に実施可能であるといえます。

=== 依頼するときに必要なこと

==== 仕様
仕様がないと話が始まりません。技術系同人誌の表紙をお願いしたいということ。タイトル文字入れ、デザイン全部込みでお願いしたい。完成原稿を納品してほしい。発注者側での使用に制限を設けないこと、など、必要な項目を明記しましょう。

==== 納期
納期は明確にしましょう。マイルストーンも記載しておくと良いです。自分の入稿から逆算して、完成原稿提出期限、入れてもらうべき文字を連絡する期限、クリーンアップ提出・確認、ラフ提出・確認、あたりがあると、絵師さんのスケジュールが立てやすいです。

・納期の例（入稿日からの逆算例）

　１．入稿日　12/15

　２．完成原稿提出　12/13

　３．原稿提出→修正指示　12/10

　４．イラスト完成　12/5

　５．タイトル・表紙文字類連絡　12/1

　６．ラフ提出　11/20　→承認後仕上げ

など、といった感じになります。これは一例で、もっと余裕をもってお願いしたほうが良いのは当然です。詳細な作業スケジュールは、絵師さんに確認してすり合わせをしておくことが重要です。

==== 本の大きさ、背表紙厚さ、綴じ方向
B5なのか、A4なのか、A5なのかによって原稿サイズが変わります。何ページくらいなのかによって背表紙の厚さが変わります。綴じ方向も、技術書ならば横書きが多いと思うので左綴じになり、表紙（表1）は右側、裏表紙（表4）は左側に来ます。これを間違えると大変なことになるので、明記しましょう。

==== その他、希望
キャラ指定、どんな感じのイラストがいいかなど、ある程度具体的にしておくとミスマッチが減ります。せっかくエントリーしてもらうので、自分の好みから外れる可能性は減らしておくとお互いに無駄な工数が減ります。（たとえば、好きではないキャラ、知らないキャラは外したいですよね？）

=== 直接依頼よりも、コンテスト形式の方がよい
コンテスト形式にすると、多数のクリエイターからのエントリーが期待できます。自ずとクオリティも上がりますし、バチっと好みに刺さる可能性が高くなります。ただし、逆に選定までの時間がかかるようになります。募集期間を2週間から3週間と考え、それから仕上げの時間が必要です。修正依頼や文字入れ作業等もありますので、余裕を持って依頼開始しましょう。
あとは、依頼ページに書いてあるテンプレートを使えば良いでしょう。

絵師によっては、既存のポートフォリオからの画像を貼ってお仕事可能です、と言ってくる人もいれば、ラフを載せてくれる人、かなり手を入れた（カラーの）イラストを上げてくれる人もいるので、自分の好みのテイストの絵師を選ぶと良いでしょう。「エントリーしたものの落選した」という履歴には評価がつかないため、ヤフオクなど違って「評価がゼロ」だからダメというわけではありません。

選定後は、スケジュール、仕様、その他相談すべき内容について詰めた上で、納品まで適宜フォローしつつ進めていくことになります。エントリーしてくれたということは、仕事やる気満々ということです。一般にこちらからの投げかけへのレスも早く、適切に仕事が進んでいく場合が多いと思われます。なお、修正依頼や仕様変更もあるかもしれませんが、必要以上に遠慮する必要はありません。もちろん無理難題を出すとか、土壇場でひっくり返すなど納期・工数的に不要なサービスさせることがないように注意したいところです。常識的な範囲内で発注しましょう。
