= 印刷所に頼む上でのあれこれ

原稿本文は出来上がりました。次は印刷所に発注ですが、発注に当たってハマりやすいことがあります。本章ではそんな誰もが通ってきた“勘所”について触れます。初めて本を作ったときに迷った、困ったネタが多く掲載されていますので、きっと役に立つことでしょう。（Text：setoazusa／大中浩行、親方）

== ページ数は4の倍数

平綴じ、中綴じにかかわらず基本的にはページ数の基本単位は4ページとなり、総ページ数は4の倍数になります。これは印刷所が両面印刷する際の最小単位が4ページだからなのですが、この理由で印刷所の価格表は4ページ刻みになっていることが多く、注意が必要です。例えば平綴じ本で30Pといった4の倍数にならないページ数の場合は、切り上げて32ページの料金になります。

また、表紙は4ページとして数えます。表1（表紙）表4（裏表紙）、表2（表紙の裏）、表3（裏表紙の裏）ですから、本文に4Pプラスされます。通常、表2、表3は白紙になり、ここに何か印刷する場合は、オプション/追加料金で対応できる印刷所があります。

最終的に本文のページ数が確定したときにページ数が余っていた場合は、なんとか埋める手段を考えましょう。注意・免責事項を改ページする、近況を嵩増しして、あとがきを増やす、何か追加コラムを入れる、などなど。逆に、ページ数を詰めることで調整できる場合もあるかもしれません。

== 手元にプリンターは用意しましょう

入稿前に、必ず一度は全てのページを印刷して仕上がりをチェックしましょう。予期せぬミスを発見することができます。ノンブルが入っているか、意図しない改ページ（白紙ページの発生など）、文字・画像の切れ、原稿サイズのミス、解像度のミス、その他様々なミスが起こりえます。しかもいずれもDTPソフト上、あるいはPDFを画面で見ただけではわかりづらいものです。紙に印刷することで、これらのミスを一気にチェックすることができます。

WYSIWYGという言葉があります。What You See Is What You Getで、見ているものと印刷結果が同じという意味ですが、PCで表示されているものと印刷で出て来るものはかならずしも一致しません。ですから、印刷して=Getできるものとして確認する必要があるのです。

=== 物書きさんにはカラーレーザーがおすすめ

出力テスト用にプリンターは持っていたほうが良いでしょう。最近はコンビニプリントもありますが、手持ちのプリンターをぜひ用意しましょう。

特に、カラーレーザーがおすすめです。ブラザーやNECのカラーレーザーなら、2万円前後から手に入ります。両面や無線LANなど機能追加に応じて若干値上がりします。
そして、ぜひ両面対応にしましょう。赤ペンを入れるときは縮小印刷して、赤ペン片手に一気にやるのが一番はやく作業が進みます。

カラーレーザーが良い点を、以下に箇条書きします。インクジェットプリンタに対する偏見も含みます。

　１．速い（安いラインでも20PPMとか普通に行く

　２．安い。本体1万で2000枚くらい印刷可能。

　３．両面が比較的デフォルト

　４．両面でも、インクが液体じゃないから、裏写りしない

　５．年に数回とか使用頻度が低いと、インクが乾く。ということがない。

　６．リサイクルトナー使えば、もっと安い。

そして、不思議な事に、ディスプレイで見ていても誤字は見つからないけど、印刷してみるとボロボロ出てくる誤字脱字……。

もっとも、入稿しないと、あるいは入稿しても誤字の根絶は無理なんですけどね。そして、推敲している時間、文章を増やす方に注力するほうがみんな幸せになるかも。


====[column] 本の完成前にも印刷してみよう

筆者の持論なのですが、本の完成前に一旦紙に印刷すると何かと執筆が捗ります。印刷するためのプリンタが家に無い場合、PDFのデータをUSBに入れてコンビニで印刷するのが最もお手軽です。

完成前にも関わらず印刷を行うメリットは２つあります。１つ目は誤字・脱字を見つけた際に、その場で書き込むことが出来ること。そして２つ目は、執筆のモチベーションを保つことが出来ることです。

筆者も触れていますが、誤字・脱字の見つけやすさが格段に上がり、直接訂正内容を紙に書き込むことが出来ます。ずっとモニタの前で文章を考えている状態から離れ、少し気分転換も兼ねて印刷したものを持ち出し、外で推敲を行うのが個人的にお薦めです。

また、完成前の状態で印刷を行うことにより、予定している全体のボリュームに対して未完成部分の比率がどれくらいあるのか、視覚的に把握することが出来ます。確認した後は、「よくここまで書いた、残りはこれだけだ！」と考えるのです。間違っても「まだこんなに残ってる」とは考えてはいけません。（Text：病葉／木田原 侑）

====[/column]

== PDF入稿

一般的に同人誌印刷に関わる印刷業界では、入稿フォーマットはAdobe PhotoshopやAdobe Illustratorなどの
DTPソフトのファイルフォーマットが主流です。
このため、技術系同人誌で多いPDFフォーマットでの入稿は、同人誌業界全体では傍流に属します。

技術書典でバックアップ印刷所となっている印刷所をはじめとして、PDF形式での入稿ができる印刷所も存在します。
しかし、PDFフォーマットでの入稿ルールについては、上にあげたPhotoshopのような同人誌業界のスタンダートな
ファイルフォーマットに比べると、
印刷所ごとのばらつきが大きいようです。事前に印刷所のWebサイトでルールの確認や、場合によっては問い合わせすることなどが
必要です。


===[column] 実際のPDF入稿時のトラブルあるある

実際にPDF入稿時には、この後の節で紹介されているような「ノンブル」や「左綴じ・右綴じ」等に関するトラブルの他にも、何かと「意図しない状態」になるトラブルがあるものです。例えば、「用紙サイズに関するトラブル」です。具体的には、「断ち切りサイズを間違えて、タイトルの一部が欠けた」とか、「意図した紙サイズのPDFに成っておらず製本できない」等です。

この用紙サイズに関するトラブルは、「実際に製本してみないと分からない」のが悩ましいところです。なので、対策としては「入稿日をなるべく早くに設定する」、「設定した入稿日に対して、1日でも前倒しして入稿する」になります。

データを入稿してから「受付完了」になるまでには、印刷所でのチェックが入ります。そして電話で「このデータで印刷するとタイトルの一部が欠けてしまう」とか「用紙サイズが不正」といった連絡をしてくれます。日程に余裕があれば、修正して再入稿できます。しかし、「直している時間が無い」「修正の仕方が分からない」となった場合には、素直に印刷所さんに「どうしたら良いでしょうか？」と相談しましょう。内容にも依りますが「では、当方で（拡大縮小などして）適切に修正して製本しますね」と、対応していただけることも多いです。

実際、私が初めての本を印刷所に発注した際には「タイトルの端が欠けます」＆「裁ち落としサイズが不足しています」と言われました。そもそもがギリギリの入稿にタイミングだったため、再入稿のリミットは６時間後、しかも電話を受けたのは外出中でした。それを伝え「修正後の再入稿の目途が立たない」旨を伝えたところ「よろしければ、当方（印刷所）で修正してしまうことも可能ですよ」と言っていただけました。もちろん「お願いします！」と全肯定です@<fn>{currectpdfbyprinter}。おかげさまで原稿を落とさずに済みました。

印刷所さんは印刷・製本のプロです。日程遅延やページ数の増減なども含めて、とにかく「想定と異なった」「困った」が発生した時点で即相談しましょう。可能な限りの対応策を提案してくれます。なお、先日にTwitter上で「初めて本出す字書きさん向け、ざっくりおすすめ印刷所さんと、本文用紙についての超ラフなわかりやすさ優先のまとめ」を掲載してくれているツイート@<fn>{pdfwriterprinterlist}を見かけました。「分かり易い」ので、そのツイートの参照もお勧めします。（Text：ほしまど）

//footnote[currectpdfbyprinter][その代わりに「完全な状態の原稿であれば割引」が適用できなくなりましたが、通常料金にて対応いただけました。]
//footnote[pdfwriterprinterlist][https://twitter.com/yakotayume/status/950322834055643136]


===[/column]



== フォントの埋め込み

入稿にあたっては、使用しているすべてのフォントがPDF内に埋め込まれている必要があります。これは、出力側で対応していないフォントがあった場合に代替フォントが使用され、意図しない出力（文字が切れる、文字化けする等）が起こることを防ぐためです。

基本的には、PDF化のときにフォントを埋め込む設定を行うことと、出力後に確認することで対応します。

=== フォントのライセンスについて

PDF等のフォーマットにより電子書籍を配布することを想定する場合、使用するフォントには注意が必要です。

一般に使われている商用フォントの使用許諾のライセンスには、印刷物の形式で使用する場合と、電子媒体の形式で配布する場合でライセンスの形態がわかれているものがあります。つまり、パッケージ形式で販売されているフォントの中には電子書籍内で使用することがライセンス条項として許諾されていないものがあります。

このため、電子書籍での配布を行う場合は、電子媒体での形式がライセンス形態として許諾されている、商用ないしフリーのフォントを選択する必要があります。

== ノンブル

第10章でも述べましたが、印刷物を製本する際にページの順序を指定するために打つページ番号のことを「ノンブル」と呼びます。

同人誌印刷では、このノンブルを白紙ページも含めて全てのページに打つ必要があります。また商業印刷と異なり、
製本した時の仕上がりの範囲内にノンブルを記す必要があります。
ノンブルの打ち方は第10章で詳しく説明されています。

== 左綴じ・右綴じ

本文の書き方によって、本の綴じる方向が変わります。横書きで記述する場合、とじ目は左側に来ます。このことを「左綴じ」と呼びます。
これに対し縦書きで記述する場合、とじ目は右側に来ます。このことを「右綴じ」と呼びます。

印刷所に発注する際は、どちら側で綴じるのかを発注する側で指定することになります。

同人誌界隈では、発注する際の両者の認識の行き違いや発注ミスにより、綴じ目が逆で製本されて納本されてしまうという事故は少なからず発生しています。

技術系同人誌の場合は横書きが多数のため必然的に多数は左綴じということになり、とじ目に対して意識が向かなくなりがちですが、
印刷所のWebページでの入稿申込時に、フォームに入力した綴じ目の指定をもう一度確認する余裕がほしいものです。

余談ですが、筆者は同人誌を入稿する際に印刷所にCD-Rの媒体を直接もちこんで入稿するのですが、
窓口でこのとじ目を指定する時は今でも緊張します。

====[column] 初めての本では左綴じ・右綴じミスりました

今から10年ほど前、初めての本を印刷所に発注したとき、右綴じ・左綴じの意味がわからず、デフォルトの右綴じのまま発注したら、綴じ方向が逆の超読みづらい本ができました。締め切りギリギリ入稿だったのもあるのかと思いますが、印刷所のチェックにも引っかからず……。

基本的に横書きの技術書は左綴じ、マンガは右綴じ、縦書きの小説や新書も右綴じになります（特段の意図を持って行う場合を除く）。

====[/column]

== トンボ

技術系同人誌においては、枠一杯まで文字/イラストが入ること（裁ち落とし、といいます）はまれで、しかもPDF入稿する場合が多くなります。したがって、印刷範囲はあらかじめ決まっているため、印刷範囲を決める指標であるトンボは不要になるケースがほとんどです。その代わり、必要な場合は塗り足しを含めた「正しいサイズの」PDFのを出力して入稿する必要があります。

== CMYKとRGB

ディスプレーの表示はRed Green Blueの三色の混合からなる色空間を使っています。一方で、印刷機のインク色は、CMYKというのは、シアン（Cyan）、マゼンタ（Magenta）、イエロー（Yellow）と、キープレート（Key plate）から、頭文字1字を取ったものです。Kは(多少語弊はありますが）要するに黒。光の三原色と、インクの4色では表現できる色の範囲が若干異なります。

パソコンなどのディスプレイはライトの発色を使用して色を表現するRGB形式ですが、印刷物ではインクによる光の吸収を使用するCMYK形式です。このため、カラー原稿をRGBフォーマットのまま入稿すると、異なった色味で仕上がる場合があります。

本文はグレースケールにすることが多いのであまり問題にならないのですが、表紙を作成するときはCMYKカラーで作ると、想定と異なる色にならなくて済みます。

仕上がりの色味を事前に確認したい場合、最も厳密に確認できる手段は実機校正（本番で使う印刷機での試し刷り）ですが、特にオフセット印刷の場合、実機校正は高コストなので現実的ではありません。
現実的な方法としては、

　・安価な簡易校正オプションを利用する。

　・手元のカラーレーザープリンタやセブンイレブンのネットプリントで試し刷りしてみる。

　・DICカラーガイドなどの色見本帳を使って色を照合する。

などの方法があります。
また、印刷所によってはオペレーターによる変換を行っていただけるところ、またRGB形式での入力が可能な印刷機を導入している印刷所もありますが、あくまでCMYK形式での変換を行って入稿するのが原則となります。

== 紙の種類と厚さ
印刷発注の際には表紙と本文の用紙を選択します。用紙の種類によって、仕上がりの本の厚さや質感が変わります。

=== 紙の種類

紙には様々な種類がありますが、よく使われるのは以下の3種です。


　・上質紙……いわゆる普通の紙です。表面に光沢はありません。

　・コート紙……表面に光沢のある紙です。

　・マットコート紙……コート紙よりは光沢が少ない紙です。

=== 紙の厚さ

印刷業界では紙の厚さを「kg」（原紙サイズ1000枚分の重量）で表現します。
数字が大きいほど厚くなります。


　・70kg……コピー用紙の厚さ

　・90kg……チラシやカタログ本文に適した厚さ

　・110kg……ポスターなどに適した厚さ

　・135kg……厚手のポスターなど

　・180kg……官製はがきの厚さ

同人誌の表紙には135kg～180kgくらいのコート紙やマットコート紙を使用するのが一般的です。
技術系同人誌の本文は基本的にモノクロ印刷でページ数は比較的多いので、90kgくらいの上質紙を使うケースが多いようです。
紙の実物を確認して選びたいという場合は、印刷所に問い合わせて用紙サンプルを送付してもらうとよいでしょう（大抵は無料でもらえます）。


== 表紙のPP加工

「PP加工」とは紙の表面全体にPPフィルムを貼る加工です。表紙の耐久性が上がるだけでなく、手触りもよくなり、どことなくプレミア感が出ます。

また、同人系印刷所の多くでは、PP加工以外にも様々な特殊加工（箔押し、エンボス加工、角丸加工 etc.）のオプションを用意しています。複数の加工を組み合わせてオリジナリティのある表紙を作るというのも同人誌制作の楽しみの一つです。（予算に余裕があれば）ぜひ挑戦してみてはいかがでしょうか？

== 遊び紙

表紙と本文の間に入る白紙が遊び紙です。役割としては、見栄えの向上です。色上質紙や、テクスチャのある薄手の紙が使われる事が多いです。印刷所の無料オプションになっていることも多いです。

透ける素材を使って本文表紙が透ける演出をしたり、有料オプションになりますが遊び紙に印刷して、本文表紙との合わせでレイヤーのような演出をするなど、遊び紙を効果的に使う事もできます。

== 搬入

イベント会場に直接運んでくれる「直接搬入」が一番ラクです。コミケなどの大規模イベントでは、印刷所のトラックが直接乗り付けて、自分のスペースに印刷した本の入ったダンボールを置いていってくれます。

直接搬入に対応していない印刷所の場合、次に候補になるのが、宅配便搬入です。印刷所からイベント会場に「宅配便で」送ります。当日朝、引き渡し場所(自分のスペースの近く。イベント要領に書いてあります)に受け取りに行きます。自宅から宅配便搬入で事前に送った場合と同じ扱いになります。

最後は、一旦自宅に送ってもらい、手持ち搬入です。唯一のメリットは、当日までに印刷物の確認ができること。ですが、搬入があまりにも大変になるので、あまりおすすめできません。50PのB5の本は、100冊程度で15kgといった重量になります。これを手持ちで会場まで運ぶのはかなりの重労働です。

== ポスターを印刷する

ポスターはぜひ印刷しましょう。当日のディスプレーとしても使えますし、遠くからも目立ちます。イベントでは大きさは、A2くらいが手頃です。

ポスターの元データですが、表紙をそのまま使う事ができます。あるいは、表紙データに本の内容を少し追記しても良いかもしれません。

印刷方法ですが、

　１．キンコーズなどで自分で印刷する

　２．入稿した印刷所のオプション/サービスを使う

　３．ネット発注して自宅へ。あとは手搬入

あたりが候補になります。
1は自由度高いものの、A2を1枚で3000円程度かかります。他の選択肢に比べると、少し高い傾向にあります。

2はおすすめです。本文印刷とセットでサービスされている場合もあり、この場合実質的な負担は発生しません。また、有料オプションとして可能なところもあり、1500円～2000円程度で対応可能な場合があります。印刷所利用の最大のメリットは、本と一緒に直接搬入してくれるところでしょう。

3のネット発注がコスト的に最もメリット高いかと思います。本を入稿した印刷所が対応していない場合に選択すると良いでしょう。A2が2枚で2500円ほどです。枚数が増えれば安くなりますが、ディスプレー用なので、2枚か3枚あれば十分です。

=== 使い終わったポスターはどうするか？
使い終わったポスターをどうするかは、本人次第です。
残しておいて記念にするもよいですね。絵師が売り子として手伝ってくれる、あるいは会う機会があるならお礼兼ねてプレゼントする（押し付けるとも言う）もありかもしれません。あとは、撤収後に欲しい人に上げるというのもありです。

筆者の場合、コミケでポスターを貰って以降、ずっとファンとして通っているサークルもあります。

==  Wordデータを入稿するための方法まとめ

本書は全体的にRe:VIEWを前提にしていますが、Word使いの人もいます。そこで、Wordで入稿する場合の最も簡単な手順を以下に述べます。しかも、ほぼ無料で可能です。

　１．Wordで原稿を書く。

　２．PDFで書き出す（一旦はA4などそのままのサイズでOK）。本文と表紙などは別ファイルでも、この時点では問題ありません。

　３．CubePDFUtility@<fn>{CubeUtility}をインストールする。

　４．順番に並べて、一つのPDFのファイルにする。

　５．CubePDFで入稿可能なPDFに変換する。

　６．入稿する。

=== CubePDFの使い方

上記5のCubePDFでの入稿可能なPDFの生成方法について説明します。

入稿PDFは、用紙サイズを塗り足し付きのサイズ（例えばB5+6mm）にしたり、グレースケールにしたりする必要があります。（B5原寸でも入稿受け付けてくれる印刷所はありますが、切れたり寸法が変わったりするリスクがあり、あまりオススメできません）

以下の設定を行います。

+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
　・詳細設定>用紙サイズ>PostScriptカスタムページサイズ>188mm×263mm@<fn>{b5size}に設定する。

　・印刷品質　1200dpi

　・TrueTypeフォント：ソフトフォンとしてダウンロード

　・PostScript出力オプション：エラーが軽減するよう最適化

　・TrueTypeフォントダウンロードオプション：アウトライン

以上を変更したうえで、一括出力します。

//footnote[b5size][B5原寸=182mm × 257mmなので、塗り足し3mmで, 188mm × 263mmになります。]

一旦PDFで書き出して結合してから原稿サイズを変更することで、すべての原稿サイズを統一することができます。

PDFの設定は入稿直前にバタバタと作業することになるので、慣れるまでは案外つまずきます。しかも入稿後、時間的余裕がないのに原稿不備の連絡が入る事が多い要因です。ですから、数ページでもかまわないので原稿ができたら（あるいはダミータイトルだけでも良いです）、一度実際にやってみて、入稿可能なファイルを作ってみましょう。一度やってあるかどうかの差は大きいです。

あとは、一度印刷して体裁の乱れなどがないことを確認してから入稿します。

//footnote[CubeUtility][@<href>{http://www.cube-soft.jp/cubepdfutility/}]

